#+STARTUP:    align fold nodlcheck hidestars oddeven lognotestate
#+FILETAGS: iEmacs
#+SEQ_TODO:   TODO(t) NEXT(i) WAITING(w@) | DONE(d) CANCELED(c@)
#+TAGS:       Write(w) Update(u) Fix(f) Check(c)
#+TITLE:      TODO central file for iEmacs
#+AUTHOR:     eggcaker
#+EMAIL:      eggcaker AT gmail DOT com
#+LANGUAGE:   en
#+PRIORITIES: A C B
#+CATEGORY:   iEmacs
#+OPTIONS:    H:3 num:nil toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t TeX:t LaTeX:t skip:nil d:(HIDE) tags:not-in-toc
#+ARCHIVE:    iemacs-todo_archive::

This file is the central page for inserting tasks related to iEmacs.

* Blogs 
  :PROPERTIES:
  :Owner_ALL: eggcaker
  :END:
** DONE write a blog for my new AWESOME iemacs wiki engine!
CLOSED: [2013-05-31 Fri 22:46]
   :LOGBOOK:
   CLOCK: [2013-05-31 Fri 17:50]--[2013-05-31 Fri 22:46] =>  4:56
   CLOCK: [2013-05-30 Thu 09:12]--[2013-05-30 Thu 09:30] =>  0:18
   :END:

** DONE add org-mode feature to iemacs
CLOSED: [2013-05-25 Sat 11:29]
:LOGBOOK:
- State "DONE"       from "NEXT"       [2013-05-25 Sat 11:29]
CLOCK: [2013-05-25 Sat 08:19]--[2013-05-25 Sat 11:29] =>  3:10
CLOCK: [2013-05-25 Sat 08:18]--[2013-05-25 Sat 08:19] =>  0:01
:END:
[2013-05-25 Sat 08:18]
** DONE create a 4x4 array of number and make sum  equals some total(ex: 68) :PUZZLE:
CLOSED: [2013-06-05 Wed 07:45]
:LOGBOOK:
CLOCK: [2013-06-03 Mon 13:01]--[2013-06-03 Mon 14:01] =>  1:00
CLOCK: [2013-06-03 Mon 10:59]--[2013-06-03 Mon 11:43] =>  0:44
CLOCK: [2013-06-03 Mon 09:13]--[2013-06-03 Mon 09:51] =>  0:38
CLOCK: [2013-05-26 Sun 09:22]--[2013-05-26 Sun 09:23] =>  0:01
:END:
[2013-05-26 Sun 09:22]
** DONE added a class to table when export post
CLOSED: [2013-05-30 Thu 22:02]
   :LOGBOOK:
   CLOCK: [2013-05-30 Thu 12:15]--[2013-05-30 Thu 18:15] =>  6:00
   CLOCK: [2013-05-28 Tue 12:09]--[2013-05-28 Tue 13:59] =>  1:50
   :END:
[2013-05-26 Sun 20:23]
* General tasks
  :PROPERTIES:
  :Owner_ALL: eggcaker
  :END:

** DONE Build the [[file:review/index.org][review index page]]
CLOSED: [2013-05-21 Tue 18:47]
:LOGBOOK:
CLOCK: [2013-05-21 Tue 17:20]--[2013-05-21 Tue 18:47] =>  1:27
:END:
** DONE Build the [[file:puzzles/index.org][puzzles index page]]
CLOSED: [2013-05-21 Tue 08:53]
